load-test/results/nestjs/vus-2000-2

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./scripts/load-test.js

    duration: -, iterations: -
         vus: 1, max: 2000

    init [----------------------------------------------------------] starting
    ✓ is status 201

    checks.....................: 100.00% ✓ 46766  ✗ 0     
    data_received..............: 15 MB   255 kB/s
    data_sent..................: 8.0 MB  133 kB/s
    http_req_blocked...........: avg=36.9µs   min=4.3µs  med=6.5µs  max=6.81ms p(90)=10.2µs  p(95)=22.17µs
    http_req_connecting........: avg=25.37µs  min=0s     med=0s     max=6.7ms  p(90)=0s      p(95)=0s     
  ✗ http_req_duration..........: avg=918.3ms  min=2.34ms med=1.22s  max=1.41s  p(90)=1.31s   p(95)=1.34s  
    http_req_receiving.........: avg=45.86µs  min=19.1µs med=43.3µs max=483µs  p(90)=63.29µs p(95)=71µs   
    http_req_sending...........: avg=18.71µs  min=7.8µs  med=15.3µs max=2.13ms p(90)=24.3µs  p(95)=36.6µs 
    http_req_tls_handshaking...: avg=0s       min=0s     med=0s     max=0s     p(90)=0s      p(95)=0s     
    http_req_waiting...........: avg=918.23ms min=2.28ms med=1.22s  max=1.41s  p(90)=1.31s   p(95)=1.34s  
    http_reqs..................: 46766   779.432327/s
    iteration_duration.........: avg=1.91s    min=1s     med=2.22s  max=2.41s  p(90)=2.32s   p(95)=2.35s  
    iterations.................: 45891   764.849012/s
    vus........................: 2000    min=66   max=2000
    vus_max....................: 2000    min=2000 max=2000